# CurveNode Methods

---
The CurveNode type exposes the following members.
| Name| Description
---|---|---
| Dispose| (Inherited from RenderNode)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetCurve|  Returns the geometric curve object corresponding to the node.
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
CurveNode Class
Autodesk.Revit.DB Namespace